Repository: khalid-hussain/hundred-hanbali-questions
Catalog: hundred-hanbali-questions-level2.tmx
Source language: ar_sa
Languages: en_gb

source: # كتاب الطهارة
en_gb: # Book of Purification

source: ## أحكام الآنية وأجزاء الميتة
en_gb: ## Rulings of using utensils and parts of dead (animals)

source: ## أحكام الاستنجاء وآداب التخلي
en_gb: ## Ruling on istinjā' (cleaning oneself with water) and etiquettes of relieving oneself

source: ## أحكام السواك
en_gb: ## Rulings of Siwāk

source: ## أحكام الوضوء
en_gb: ## Rulings of Wuḍūʾ

source: ## أَحْكَامُ المَسْحِ على الخُفيْنِ
en_gb: ## Rulings on wiping over the _khuff_ (footgear/leather socks)

source: ## باب التيمم
en_gb: ## Chapter of Tayammum

source: ## باب الغسل
en_gb: ## Chapter of Ghusl

source: ## باب المياه
en_gb: ## Chapter of Water

source: ## باب نواقض الوضوء
en_gb: ## Chapter of Wuḍūʾ Nullifiers

source: ## فصل في إِزَالةِ النَّجاسَةِ
en_gb: ## Removing _najāsah_ (impurities)

source: (انظر: مجموع الفتاوی: ۱۷۹/۲۱).
en_gb: (See _Majmūʿ al-Fatāwā_ [21/179]).

source: **الأول**: أغسال تتعلق بالطهارة وهي الغُسل لغُسل میت، ولجنون، وإغماء، واستحاضة.
en_gb: First, _aghsāl_ that are related to _ṭahārah_ (purification). These are the ghusl due to cleaning a corpse, after coming out of insanity and unconsciousness, and for istiḥāḍah.

source: **والثالث**: أغسال تتعلق بالحج: وهي الأغسال المتبقية من 9–16.
en_gb: Third, _aghsāl_ related to Ḥajj. These are the remaining ones from 9--16.

source: **والثاني**: أغسال تتعلق بالصلاة وهي الغُسل لصلاة جمعة، وعيد، وكسوف، واستسقاء.
en_gb: Second, _aghsāl_ that are related to the prayer. These are the _ghusl_ for the Friday prayer, the Eid prayer, the Eclipse prayer (kusūf), and the prayer asking for rain (istisqāʾ).

source: - أن يمسحَ ثلاثَ مَسَحَاتٍ تعمُّ كُلَّ مَسْحَةٍ المحلِّ.
en_gb: - That (a person) wipes (the place) thrice, each wiping spreading over the (affected) area.

source: - أَنْ يُقَدِّمَ اليُسْرىٰ عندَ دخولِ الخلاءِ، ويقولَ (بسم الله، أعوذُ باللهِ من الخُبْثِ والخَبَائِثِ).
en_gb: - Entering the toilet with one's left foot and saying: ::: {custom-style="Arabic Dua"} بِسْمِ اللهِ، أَعُوذُ بِاللهِ مِنَ الخُبْثِ وَالخَبَائِثِ . ::: ::: {custom-style="Arabic Dua Translation"} In the name of Allāh. I seek refuge in Allāh from the male and female devils. :::

source: - أَو انغمستْ فيهِ كلُّ يدِ المسلمِ المكلَّفِ القائِمِ مِنْ نَوْمِ ليلٍ قبلَ غَسْلِهَا ثلاثًا بنيّةٍ وَتَسْمِيَّةٍ.
en_gb: - That was dipped in by any hand of a sane _mukallaf_ Muslim who had awakened from sleep, before washing them three times with intent and saying _Bismillāh_.

source: - أَوْ كَانَ قَلِيْلًا وَاستُعملَ فِي رَفَعِ حَدَثٍ.
en_gb: - That was _qalīl_ and used to lift ritual impurity.

source: - إِمَّا أنْ يكونَ هذا الماءُ قليلًا.
en_gb: - The water is _qālil_.

source: - الكثيرُ: وهو ما فوقَ القُلَّتَيْنِ.
en_gb: - _Kathīr_: That which is greater than _qullatayn_.

source: - اليسيرُ أو القليلُ: وهو ما دونَ القُلَّتَيْنِ.
en_gb: - _Yasīr_ or _Qalīl_: That which is lesser than _qullatayn_.

source: - ما تغيَّر كثيرٌ من لَوْنِهِ أو طَعْمِهِ أو رِيْحِهِ بِمُخَالَطَةِ شَيْءٍ طَاهِرٍ كَزَعْفرانٍ.
en_gb: - Whose color, taste, or smell has changed due to mixing with a pure substance like Saffron.

source: - وإذا خَرَجَ قَدَّم اليُمْنىٰ وقالَ (غُفْرَانَكَ، الحمدُ للهِ الَّذِي أَذْهَبَ عَنِّي الأَذىٰ وعافَاني).
en_gb: - Using the right foot first to exit the toilet and saying the _duʿāʾ_: ::: {custom-style="Arabic Dua"} غُفْرَانَكَ، الحَمْدُ لِلهِ الَّذِي أَذْهَبَ عَنِّي الأَذَىٰ وَعَافَانِي ::: ::: {custom-style="Arabic Dua Translation"} [O Allāh, I seek] Your forgiveness. All Praise be to Allāh who has removed from me discomfort and granted me relief. :::

source: - وإِمَّا أَنْ يكونَ كثيرًا.
en_gb: - The water is _kathīr_.

source: - وَأَنْ لا يتجاوزَ الخارجُ موضعَ العادةِ.
en_gb: - The thing coming out doesn't extend beyond the place of _ʿādah_ (area of the two openings).

source: 4.ومَسُّ فَرْجِ الآدميِّ قُبُلًا أو دُبُرًا باليد بلَا حائلٍ.
en_gb: Touching the private parts, either in the back or front, with bare hands without a (covering?).

source: [^ف1]: أمّا في الطهارة الكبرى فلا تشترط الموالاة.
en_gb: [^fn1]: As for ṭahārah kubrá (major purification), muwālāh is not a condition.

source: [^ف1]: توضیح: ابتداء مدة المسح على الخفين من وقتِ الحَدَث بعد لبسهما على طهارة.
en_gb: [^fn-1]: Note: The time period for allowance of wiping over _khuffs_ starts when the state of purity in which they were put on is lost.

source: [^ف1]: دليله: حديث أبي هريرة قال: قال رسول الله ﷺ: «طهور إناء أحدكم إذا ولغ فيه الكلب أن يـغسله سبع مرات أولاهن بالتراب.» رواه مسلم (279) وغيره.
en_gb: [^fn-1]: The author's evidence is the _ḥadīth_ of Abū Hurayrah \FPHIM who said that the Prophet \FPBUH said, «Your vessels are _ṭahūr_; if a dog licks them, clean them seven times, with the first of them being with earth.» Narrated by Muslim (279) and others.

source: [^ف1]: دليله: حديث جابر بن سمرة: «أن رجلا سأل رسول الله: أنتوضأ من لحوم الغَنَم؟ قال: إن شئت توضأ، وإن شئت فلا تتوضأ.
en_gb: [^fn-1]: The author's evidence is the _ḥadīth_ of Jābir ibn Samurah that a man asked the Messenger of Allāh, “Will you make wudu due to (consuming) mutton?” He replied, «If you so wish, make _wuḍūʾ_; if you so wish (otherwise), don't make _wuḍūʾ_.»

source: [^ف1]: فيجب الغُسل بمجرد الانتقال، ولو لم يخرج، ومثاله: ما لو أحس بانتقال المنيّ فحبسه حالًا فلم يخرج وجب الغُسل، لوجود الشهوة بانتقاله أشبه ما لو ظهر.
en_gb: [^fn1]: _Ghusl_ becomes obligatory just its moving [from its original place] even if it doesn't exit [the body]. For example, if one feels the movement of manī and holds it in immediately and it doesn't exit, ghusl becomes obligatory because of the presence of desire; its movement thus resembles ejaculation even if _manī_ is not excreted.

source: [^ف1]: ورد من حديث عمر بن الخطاب قال: قال رسول الله صلى الله عليه وسلم: «ما منكم من أحدِ يتوضأ فيسبغ الوضوءَ، ثم يقولُ: أشهد أن لا إله إلا الله وأشهد أن محمدًا عبده ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء» رواه مسلم (234) وأبو داود (169) والترمذي (55) وزاد: «اللهم اجعلني من التوابين واجعلني من المتطهرين» وأما زيادة «واجعلني من عبادك الصالحين» فلا أصل لها.
en_gb: [^fn1]: It is reported in the _ḥadīth_ of ʿUmar ibn al-Khaṭṭāb \FP_HIM who said that the Prophet \FPBUH said, “Whoever makes _wuḍūʾ_ and perfects it and then says ‘I bear witness that there is no deity (worthy of worship) except Allāh and that Muḥammad is His servant and messenger,’ except that the eight doors of Jannah will open for him and he can enter from whichever he wishes.” Reported by Muslim (234), Abū Dāwūd (169), al-Tirmidhī (55) and there is an extension: “O Allāh, make me from the repentant and make me from the pure.” As for the extension “...and make me from your righteous slaves,” it has no basis.

source: [^ف2]: أي: حكم غسل الميت تعبدي، لا لوجود حَدَث فيه، كباقي الموجبات السبع.
en_gb: [^fn2]: The ruling of _ghusl_ after cleaning a corpse is (taʿabbudī), and not due to the presence of _ḥadath_ (spiritual impurities) as in the other seven circumstances.

source: [^ف2]: أي: يحرم عليه قراءة القرآن، والمقصود قراءة آية فأكثر، ويباح له قول ما صادف لفظه لفظ القرآن إن لم يقصد القرآن کالبسملة والحمدلة، وقول مسترجع (إنا لله وإنا إليه راجعون) وقول راكب: [﴿سُبۡحَٰنَ ٱلَّذِی سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُۥ مُقۡرِنِینَ ۝١٣﴾]{custom-style="quran"}، ويباح له أيضًا ذكر الله تعالىٰ، ومتابعة المؤذّن، وكذا الاستماع للقرآن من قاریء أو مسجلٍ ونحوه.
en_gb: [^fn-2]: i.e. it is impermissible for him to recite the Quran. What is meant is the recitation of an _āyah_ or more. [However,] it is permissible for him to say what is coincidently a phrase from the Quran if he didn't intend by it the Quran, such as the _basmalah_, the _ḥamdalah_, the saying of the _mustarjiʿ_ (innā li-llāhi wa innā ilayhi rājiʿūn), and the saying of the rider (subhan alladhi sakhkhara lanā hadhā wa mā kunnā lahu muqrinīn). It is also permissible for him to say phrases of Allāh's dhikr, to repeat after the muʾaththin, and similarly to listen to the recitation of the Quran from a reciter or from a recording and suchlike.

source: [^ف2]: دليله: حديث ابن عمر قال: «أُمرنا بغسل الأنجاسِ سبعًا» ذكره ابن قدامة في «المغني» (1/75) ولم يذكر من خرجه، وتابعه على ذكره جماهير الأصحاب.
en_gb: [^fn-2]: The author's evidence is the _ḥadīth_ of Ibn ʿUmar who said, “We were commanded to clean _najāsah_ seven times.” Ibn Qudāmah related it in _al-Mughnī_ (1/75) but didn't mention who collected it. (XXX)

source: [^ف2]: وهي: ثمانون كيلًا تقريبًا.
en_gb: [^fn-2]: It is approximately 80km.

source: [^ف2]: يلاحظ أن المصنف (رحمه الله تعالى) قد ذكر بَدءًا أن سنن الوضوءِ ثمانية عشر، ثم عدها تسعة عشر، والظاهر أنه في البدء تبع صاحب الدليل في العدّ.
en_gb: [^fn2]: Unfortunately, the author (May Allāh have mercy on him) mentioned in the beginning that there were eighteen (18) _sunan_ of _wuḍūʾ_ and then went on to mention nineteen _sunan_. It appears that he has followed the author of _Dalīl al-Ṭālib_ in the number of _sunan_.

source: [^ف3]: صِمَاخ الأذنين: الخرق المفضي من الأذن إلى الرأس.
en_gb: [^fn3]: (FILLER): (FILLER).

source: [^ف3]: فإن تَوَضأ جاز له الجلوس في المسجد لحديث عطاء قال: رأيت رجالًا من أصحاب رسول الله صلى الله عليه وسلم يجلسون في المسجد وهم مجنبون إذا توضؤوا وضوءَ الصلاة.
en_gb: [^fn-3]: If he makes _wuḍūʾ_, staying in a masjid is permissible for him due to the _ḥadīth_ of ʿAṭāʾ who said, “I saw men from the companions of the Messenger of Allāh FPBUH sitting in the Masjid in a state of major impurity, but they would only make _wuḍūʾ_ like that for Ṣalāh.”

source: [^ف3]: كالشمع والدُّهنِ والطّلاءِ ونحوها.
en_gb: [^fn3]: Such as wax, fat, paint, and other similar substances.

source: [^ف3]: ومثله البعوض والخنفساء والذباب ونحوها.
en_gb: [^fn-3]: Similar to it are mosquitoes, beetles, flies, and other such creatures.

source: [^ف3]: ومحل الفرض: الرِجْلَانِ مع الكعبين.
en_gb: [^fn-3]: _Maḥal al-Farḍ_: The two feet upto the ankles.

source: [^ف4]: أي : يُسن لذکر يرید حضور صلاة الجمعة، الاغتسال في يوم الجمعة، وعليه: فلا يسن الاغتسال لامرأة، ولا لذكرٍ لا يحضر الجمعة لسقوطها عنه – کالمسافر – ولا يحقق السنة من اغتسل الجمعة قبل يومها.
en_gb: [^fn4]: In other words, performing _ghusl_ is sunnah_ for males who intend to attend the Friday prayer on Friday. On this basis, _ghusl_ is not _sunnah_ for women nor for males who do not intend to attend the Friday prayer due to it not being obligatory -- due to travel for example. This _sunnah_ is not established if _ghusl_ is performed before the day of Friday (i.e. in its night).

source: [^ف4]: توضیح: الجبيرة لا تخلو من حالتين: الحالة الأولى: أن توضع على طهارة.
en_gb: [^fn-4]: Note: (FILLER) in/from two situations/states: First: It is placed in a state of purity.

source: [^ف4]: دليله: حديث أنس بن مالك -- رضي الله عنه -- قال: «قدم أناس من عكل أو عرينة فاجتووا المدينة، فأمرهم النبي ﷺ بلقاح وأن يشربوا من أبوالها وألبانها.» رواه البخاري (231) ومسلم (1671).
en_gb: [^fn-4]: The author's evidence is the _ḥadīth_ of Anas ibn Mālik \FPHIM. He said, “A people from ʿUkl or ʿUraynah came to Madīnah but its weather didn't suit them. The Prophet \FPBUH ordered them [to go to] (Milch camels) and drink from their urine and milk.” This was relayed by al-Bukhārī (231) and Muslim (1671)

source: [^ف5]: هذه الأغسال تنقسم ثلاثة أقسام:
en_gb: [^fn5]: These _aghsāl_ (sing. _ghusl_) are divided into three types:

source: [^ف6]: أي: إذا كانت هناك حاجة للتيمم – كما لو فُقد الماء، أو غلا سعره، أو خاف بردًا ونحو ذلك.
en_gb: [^fn6]: i.e. in situations where there is a need for _tayammum_ -- if there is no water, or if its expensive to obtain, or if one fears the cold, and other similar scenarios.

source: [^ها-1]: توضیح: كلُّ ماءٍ وَقَعَتْ فِيه نَجَاسَةٌ فلا يخلو من حالتين:
en_gb: [^fn-1]: Any water in which _najāsah_ falls into, is of two states:

source: [^ها-1]: فإن عُلِمتْ نجاسةُ الآنيةِ أَو الثيابِ غُسلتْ ثم استُعْملتْ.
en_gb: [^fn-1]: If the impurity of the containers or clothes becomes known, they should be washed and then used.

source: [^ها-2]: توضیح: ينقسمُ الماءُ باعتبارِ حجمهِ إلى قسمينِ:
en_gb: [^fn-2]: Note: With regard to volume, water is divided into two categories:

source: [^ها-2]: ومثاله: أن يُتَّخِذَ الجلدُ وِعاءً للقمح والشعير والتراب والحصىٰ ونحو ذلك، أما لو جعل وعاءً للماء ونحوه فلا يجوز.
en_gb: [^fn-2]: For example: Using the skin as a container for (storing) wheat, barley, dirt, pebbles etc. As for using it as a vessel for keeping liquids in it then it's impermissible.

source: [^ها-3]: القُلَّتَانِ: تثنيةُ قُلَّة: وهي الجَرَّةُ الكبيرةُ الكبيرة، سميتْ بذلك لأن الرجلَ القويَّ يُقِلّها - أي يحملُها.
en_gb: [^fn-3]: _Qullatān_ - the dual of _qullah_, which isa big jar. It is called such because a strong man is required to carry it (_yuqilluhā_).

source: [ج] آنية الكفّارِ وثيابهم طَاهِرةٌ، ما لم تُعْلَمْ نَجَاسَتُهَا.[^ها-1]
en_gb: The utensils and clothes of Kuffār are _ṭāhir_ as long as their impurity is not known.[^fn-1]

source: [ج] أقسام الماء ثلاثة:
en_gb: There are three (3) types of water:

source: [ج] إن وضعها على طهارة، ولم تتجاوز محل الحاجة، غسل الصحيح، ومسح على الجريح.
en_gb: If put on in a state of purity and does not exceed the wounded area, everything should be washed and the wounded area wiped over.

source: [ج] الأغسالُ المسنوناتُ ستة عشر، وهي:
en_gb: The circumstances for which _ghusl_ is _sunnah_ are sixteen (16). They are:

source: [ج] السواكُ مسنونٌ كلَّ وقتٍ، لغير صائمٍ بعد الزوال فيكره.
en_gb: Using Siwāk is _sunnah_ (recommended) at all times except after _zawāl_ for a fasting person.

source: [ج] الطهارة لغةً: النظافة.
en_gb: Linguistically, purification means cleanliness.

source: [ج] سننه سبعة، وهي:
en_gb: Its _sunnah_ actions are seven. They are:

source: [ج] سُنَنُهُ ثمانيةَ عَشَرَ، وهيَ:
en_gb: The _sunan_ of Wuḍūʾ are eighteen (18) and they are:

source: [ج] شرط صحّتِهِ الإِنْقَاءُ:
en_gb: Its condition is purity/cleanliness.

source: [ج] شروط الغُسْلِ سبعةٌ، وهي:
en_gb: The conditions of _ghusl_ are seven. They are:

source: [ج] شروطُهُ ثمانيةٌ، وهي:
en_gb: The conditions of Wuḍūʾ are eight (8) and they are:

source: [ج] صفتُهُ:
en_gb: Its characteristics are:

source: [ج] عظمُ المَيْتَةِ وَقرنُهَا يَطْهُرُ بِالدِّبَاغِ، وكذا جِلْدُهَا، ولا يَطْهُرُ بِالدِّبَاغِ، لكنْ لَوْ دُبِغَ يُبَاحُ استعمالُهُ في اليَابِسَاتِ دُونَ المَائِعَاتِ.[^ها-2]
en_gb: Bones and horns of carrion are _najis_. Its skin is also impure and doesn't become pure by tanning. However, it becomes permissible to use for dry things (as opposed to wet things) when tanned.[^fn-2]

source: [ج] فرضُه شيء واحد، وهو: أن يعمَّ [بالماء] جميعَ بَدَنِهِ، وداخلَ فَمِهِ وَأَنْفِهِ.
en_gb: It has one obligatory aspect: that is to cover one's whole body ‹with water, including the› inside of the mouth and nose.

source: [ج] فروضٌ الوُضُوءِ سِتَّةٌ، وهي:
en_gb: The obligatory parts of Wuḍūʾ are six (6) and they are:

source: [ج] من تيَقَّنَ الطهارة وشكَّ في الحَدَثِ، أو تیقَّنَ الحَدَثَ وشَكَّ في الطَّهَارَةِ، عَمِلَ بما تيقّن.
en_gb: Whoever is certain of his _ṭahārah_ but doubts impurity, or is certain of impurity and doubts his _ṭahārah_, then he should base his actions on certainty.

source: [ج] موجبات الغُسْلِ سَبعة، وهي:
en_gb: ‹Actions› that obligate _ghusl_ are seven (7). They are:

source: [ج] نعم.
en_gb: Yes.

source: [ج] نواقضُ الوضوءِ ثمانيةٌ، وهي:
en_gb: The nullifiers of Wuḍūʾ are eight (8). They are:

source: [ج] هو: إزالةُ ما خَرَجَ مِنَ السَّبِيْلينِ بماءٍ طَهُورٍ، أو حَجَرٍ مُبَاحٍ ونحوِهِ کالخِرَقِ.
en_gb: It means getting rid of what comes out from the two openings with Ṭahūr water, or a permissible (to use) stone and its likes, e.g. pieces of torn cloth.

source: [ج] هي:
en_gb: They are:

source: [ج] يبطلُهُ أحدُ ثلاثةِ أشياءَ، وهيَ:
en_gb: It is invalidated by one of the following three:

source: [ج] يجب فيه شيء واحد، وهو التسمية.
en_gb: Only one thing is obligatory in it and that is the _tasmiyah_ (i.e. saying the _basmalah_)

source: [ج] يجبُ فيهِ التسميةُ فقط وتسقطُ بتركِهَا سَهْوًا، أَوْ جهلًا لا عَمْدًا.
en_gb: The only _wājib_ is to recite the _basmalah_ but this is (dropped) if forgotten or out of ignorance but not deliberately.

source: [ج] يجوز بشروطٍ سبْعةٍ، وهي:
en_gb: It's permissible to wipe over them on seven conditions:

source: [ج] يحرمُ علىٰ المُحْدِثِ حَدَثًا أصغرَ أَوْ أكبرَ:
en_gb: Impermissible for one in a state of impurity, _asghar_ or _akbar_ are:

source: [ج] يسن:
en_gb: It is recommended to:

source: [ج] يمسح مقيمٌ وعَاصٍ بسفرِهِ يَوْمًا وليلةً مِنْ حينِ حَدَثٍ بَعْدَ لُبْسٍ.[^ف1]
en_gb: The resident or the one whose travel is sinful wipes for (a duration of) one day and one night, starting from the time ablution was invalidated after wearing the _khuffs_.[^fn-1]

source: [ج] يُبَاحُ اتخاذُ كُلِّ إِنَاءٍ طَاهِرٍ، واستعمالُهُ إلا آنية الذّهبِ والفضةِ، فيحرمُ استعمالُهُما واتّخاذُهما.
en_gb: It is permissible to acquire any _ṭāhir_ utensils except those of gold and silver. Thus it's _ḥarām_ to use utensils of gold and silver.

source: [ج] يُكرهُ لَهُ:
en_gb: It is disliked to:

source: [س] أخبرني عن حكم المسح عليها؟[^ف4]
en_gb: Inform me of the ruling over wiping over it.[^fn-4]

source: [س] أخبرني عن صفةِ الوضوءِ الكامل؟
en_gb: Q: Inform me of the all the characteristics of Wuḍūʾ.

source: [س] كم أَقْسَامُ المَاءِ؟ وَمَا هِيَ؟
en_gb: How many types of water are there? And what are they?

source: [س] كم الأغسَالُ المسنوناتُ؟ وما هيَ؟
en_gb: How many circumstances for which _ghusl_ is _sunnah_? And what are they?

source: [س] كم شروطُ الغُسْلِ؟ وما هيَ؟
en_gb: How many conditions of _ghusl_? What are they?

source: [س] كم شروطُ الوضوءِ؟
en_gb: What are the conditions of Wuḍūʾ?

source: [س] كم مُدَّةُ المَسْحِ عليهما؟ وما المقدارُ الذي يجبُ مَسْحُهُ؟
en_gb: What's the duration for (which) wiping over them (is permissible)? And what is the portion which is obligatory to wipe on?

source: [س] كم نواقض الوضوء؟
en_gb: Q: How many nullfiers of Wuḍūʾ are there?

source: [س] كيف يَطْهُرُ المتنجسُ؟
en_gb: How is something with _najāsah_ purified?

source: [س] ما الذي يجب في الغُسْل؟
en_gb: What is obligatory in _ghusl_?

source: [س] ما الذي يجبُ في الوُضُوءِ؟
en_gb: What are the _wājibāt_ of Wuḍūʾ?

source: [س] ما الذي يُبَاحُ اتّخَاذُهُ مِنَ الأواني؟
en_gb: What utensils are permissible for acquisition?

source: [س] ما الذي يُسَنُّ فِعْلُهُ من التنظيفِ وتحسينِ الهيئةِ؟
en_gb: What are the recommended acts in terms of cleaning and adorning oneself?

source: [س] ما الطَّاهر وما النجس من الحيوان؟
en_gb: Which animals are _ṭāhir_ (pure) and which are _najas_ (impure)?

source: [س] ما حكمُ الخارجِ مما يؤكلُ لحمُهُ؟
en_gb: What is the ruling of the excrement of [animals] whose meat can be eaten?

source: [س] ما حكمُ السواكِ؟ وفي أيّ محل يتأكدُ؟ وما فائدتُهُ؟
en_gb: What is the ruling on using Siwak? When is its use emphasized? What are its benefits?

source: [س] ما حكمُ المسحِ على الخفين؟
en_gb: What's the ruling on wiping over the _khuffs_?

source: [س] ما حكمُ مَنْ شَكَّ في الطَّهَارَةِ؟
en_gb: Q: What is the ruling of one who doubts his _ṭahārah_?

source: [س] ما حُكْمُ آنية الكفَّارِ وَثِيَابِهم؟
en_gb: What's the ruling on using utensils and clothes of Kuffār?

source: [س] ما حُكْمُ أَجْزاءِ المَيْتَةِ؟
en_gb: What is the ruling on parts of carrion?

source: [س] ما شرط صحّتِهِ؟
en_gb: What is the condition of its validity?

source: [س] ما فرضُ الغُسل؟
en_gb: What are the obligatory aspects of _ghusl_?

source: [س] ما هو الاستنجاء؟ وما حكمه؟
en_gb: What is istinjā'? And what's its ruling?

source: [س] ما هي آداب قاضي الحَاجَةِ؟
en_gb: What are the etiquettes of relieving oneself?

source: [س] ما هي الطهارة لغةً وشرعًا؟
en_gb: What is purification linguistically and technically?

source: [س] ما واجب التيمم؟
en_gb: What are the wājib actions of tayammum?

source: [س] ما يحرمُ علىٰ المُحْدِثِ فعلُهُ؟
en_gb: What actions are prohibited for one in a state of impurity?

source: [س] ما يكره لقاضي الحاجة؟ وما يَحرمُ عليه؟
en_gb: What is disliked and prohibited when relieving oneself?

source: [س] ما يُبْطلُ المسحَ عليهما؟
en_gb: What invalidates wiping over them?

source: [س] هل يجوز المسح على غير الخفين؟
en_gb: Is wiping allowed on other than the _khuffayn_?

source: [س] کم سُنَنُ الغُسْلِ؟ وما هي؟
en_gb: How many _sunnah_ actions of _ghusl_ are there? What are they?

source: [س] کم سُنَنُ الوُضُوءِ؟ وما هِيَ؟
en_gb: How many _sunan_ of Wuḍūʾ are there? What are they?

source: [س] کم شروط صحة التيمم؟ وما هي؟
en_gb: How many conditions are there for the validity of tayammum? What are they?

source: [س] کم فرائضُ الوُضُوءِ؟ وَمَا هِيَ؟
en_gb: What are the obligatory parts of Wuḍūʾ

source: [س] کم فروض التيمم؟ وما هي؟
en_gb: How many farḍ ‹actions› in tayammum? And what are they?

source: [س] کم مبطلات التيمم؟ وما هي؟
en_gb: How many things render tayammum void? What are they?

source: [س] کم موجباتُ الغُسْلِ؟ وما هي؟
en_gb: How many ‹actions› obligate _ghusl_? What are they?

source: [س]: ما حُكم الخارج مما لا يؤكلُ لحمُهُ؟
en_gb: What is the ruling of the excrement of [animals] whose meat is not eaten?

source: أن ينويَ الوضوءَ للصلاةِ.
en_gb: To intend the Wuḍūʾ for Ṣalāh.

source: أنّه يهضمُ الطَّعامَ.
en_gb: It aids in digestion

source: أو انقضاءُ مدةِ المَسْحِ.
en_gb: The cessation of the allowed period for wiping.

source: أو ظُهورُ بعض محلّ الفَرْضِ.[^ف3]
en_gb: When the _Maḥal al-Farḍ_[^fn-3] ceases to be covered.

source: أو ظِلٍّ نَافِعٍ.
en_gb: and (To relieve oneself) in beneficial shade.

source: أَكْبَرُ: وهو ما أَوْجَبَ الغُسْلَ.
en_gb: _Akbar_: That which necessitates _Ghusl_.

source: إما أن تتجاوز محل الحاجة، فإن قدر على نزعها وإعادة ربطها بحيث لا تتجاوز محلَّ الماء فَعَل، وإلا وَجَبَ عليه أن يتوضأ ويتيمم.
en_gb: It exceeds the required area; it should be (re)moved and reattached(FILLER Water something), if possible. If not, it is compulsory to perform _wuḍūʾ_ and _tayammum_.

source: استقبالُ الشَّمسِ والقَمَر.
en_gb: Face the sun and the moon.

source: استقبالُ القِبْلَةِ.
en_gb: Facing the _qiblah_.

source: استقبالُ القِبْلَةِ، واستدبارُها في الصّحراءِ بلا حَائلٍ.
en_gb: Face the _qiblah_ and turning one's back towards it when in vacant areas without any barriers.

source: الأول : طَهُورٌ: وهو الباقي على خِلْقَتِهِ الأَصْلِيَّةِ، سواءٌ نَزَلَ مِنَ المَاءِ أو نَبَعَ مِنَ الأَرْضِ.
en_gb: First: _Ṭahūr_. Is is water that remains upon its initial original creation; whether it descends from the sky (i.e. rain) or sprouts from the ground.

source: الثالث: نَجِسٌ: وهو ما وَقَعَتْ فِيْهِ نَجَاسَةٌ، وكانَ قليلًا، وإِنْ لم يتغيَّر أو كثيرًا وتغيَّر أحدُ أوصَافِهِ.[^ها-1] ولا يرفعُ الحَدَثَ، ولا يزيلُ الخَبَثَ.
en_gb: Third: _Najis_. It is _qalīl_ water in which _najāsah_ has fallen, even if it doesn't change one of its characteristics;[^fn-1] or _kathīr_ water where at least one of its characteristics change. It doesn't lift ritual impurity nor remove physical impurity.

source: الثاني: طَاهِرٌ: وهو:
en_gb: Second: _Ṭāhir_. It is water:

source: الحالة الثانية: أن توضع على غير طهارة.
en_gb: Second: It was put on when not in a state of purity.

source: الحمد لله وحده، والصلاة والسلام على من لا نبي بعده:
en_gb: Praises are for Allāh alone and Peace and Blessings be upon the last Prophet \BPBUH.

source: الخارجُ من السبيلين قليلًا كان أو كثيرًا، طاهرًا أو نجسًا.
en_gb: Whatever exits from the two passages, irrespective if a little or a lot, and irrespective if _ṭāhir_ of _najis_.

source: الصلاةُ.
en_gb: Ṣalāh

source: الغُسْلُ لصلاةِ جمعةٍ في يومها، لذكرٍ حَضَرها.[^ف4]
en_gb: Ghusl for the Friday prayer on its very day, for males who will attend.[^fn4]

source: النية .
en_gb: Intention

source: الوُضُوءُ قبلَهُ.
en_gb: ‹Performing› _wuḍūʾ_ before it.

source: انتقالُ المنيّ من مقرّه.[^ف1]
en_gb: The movement of semen from (its place?)[^fn1]

source: انظر «الروض المربع» (ص 43).
en_gb: See _al-Rawḍ al-Murbiʿ_ (p. 43).

source: انظر حاشية «الروض» (1/324–325).
en_gb: See the marginalia of _al-Rawḍ al-Murbiʿ_ (1/324--325).

source: انظر: «المستوعب» (1/314)، «الممتع في شرح المقنع» (8/271--273).
en_gb: See _al-Mustawʿib_ (1/314) and _al-Mumtiʿ fī sharḥ al-Muqniʿ_ (8/271--3).
